#циклы 
#for i in range (1,6): # for переменная in , диапазон (значение, конечное значение , опрееделенный шаг например 2 )
#    print(i)
count = 0 
word = "Hello world!"
for i  in word:
    if i == "l":
        count += 1 # если не указать значение то цикл будет бесконечным 
print("count:", count)       
####################################################################################################
o= 6
while o <=8:
    print(o)
    o+=1 # если не указать значение то цикл будет бесконечным 
################################################################################################
titi= True
while titi:
    if input("Enter date : ")=="stop":
        titi = False
################################################################################################
for a in range(1, 10):
    if a ==5:
        break # останавливает цикл 
    if a - 2 ==0:
        continue # пропускает определенные условия 
    print(a)
###################################################################################################
fount = None #переменна без значение none
for iii in "hello":
    if iii== "m":
        fount = True
        break
else:
    fount = False

print(fount)