print("5 * 5 результат:", 5*5) # операции +-*/ классика короче 
print(5**2) # возведение в квадрат 
print(5//3) #  //выводит целое число , к меньшему 
print("результат:" , min(5,6,1,0,9,7) ) # min (числа)выводит минимальные значения 
print("результат:" , max(5,6,1,0,9,7) ) # max  выводит максимальео число
print("результат:" , abs(-5) )  # по модулю , выводит полож
print("результат:" , pow(5, 3 ) ) # pow степерь возведение 
print("результат:" , round(5/3 ) ) # окургление к ближайшему целому числу 