#получение значений от пользоватея 
#input("текст")  взаимодействое с консолью пользователя 
################################################################
number = 5  # переменная 
# удаление переменно del (number)
print ("текст", number)
number = 7 # можно переназначать переменные 
print ("текст", number)
################################################################
digit = 15.5
text = "результат"
print(digit, text)
################################################################
bulka = True # тип данных булиан 
print(bulka)
#################################################################
ausi= 19
bubu = "Строка "
print( bubu + str(ausi)) # str прелбразует цыфру в строку при выводе 
################################################################
ausi_lol= '19'
bubu = "Строка "
print( ausi + int(ausi_lol)) # работает тока для привязки цифр к цифрам int 
################################################################
rick= "текст"
joni = 123
donni = "7"
print(rick + str(joni + int(donni))) # преобразование функций , весело )
